{
  "objetivo_bncc": "EF03MA12 - Descrever os elementos de uma sequência (como comandos de uma 'máquina inteligente') por meio de regras de formação, usando termos como 'o próximo', 'sempre o mesmo', em um contexto de introdução à Inteligência Artificial.",
  "passo_a_passo": [
    {
      "etapa": "Aquecimento: O Robô Obediente (5 minutos)",
      "descricao": "O professor explica que os robôs (e as IAs) precisam de comandos muito claros para funcionar. Divide a turma em duplas, onde um será o 'robô' e o outro o 'programador'. O programador dará 3 comandos simples (ex: 'levante o braço esquerdo', 'dê um passo para frente', 'bata palmas') e o robô deverá executar exatamente, sem pensar por si mesmo. Reforçar a importância da clareza dos comandos."
    },
    {
      "etapa": "Desenvolvimento 1: A Máquina de Somar (15 minutos)",
      "descricao": "O professor apresenta uma 'Máquina de Somar Inteligente' no quadro. Explica que essa máquina tem uma 'regra secreta'. Desenha quadros de entrada e saída, por exemplo: 'Entra 2 -> Sai 4', 'Entra 5 -> Sai 7', 'Entra 8 -> Sai 10'. A turma, em conjunto, deverá descobrir a 'regra' (sempre adiciona 2). Em seguida, o professor dará novos números para 'entrar' na máquina e os alunos devem 'calcular' o que 'sai', explicando a regra que a 'máquina' segue. Isso introduz a ideia de algoritmo e padrão matemático."
    },
    {
      "etapa": "Conclusão e Reflexão: Nossas Regras Robóticas (10 minutos)",
      "descricao": "Revisitar o conceito de Inteligência Artificial como 'máquinas que seguem regras e padrões' para parecerem inteligentes. Pedir que cada aluno, individualmente ou em duplas, crie uma 'regra' simples para uma 'máquina inteligente' fazer algo (ex: 'se virar a luz vermelha, pare' ou 'se ouvir música, dance'). Compartilhar algumas regras e discutir como elas são como 'pequenos programas'."
    }
  ],
  "introducao_ludica": "Olá, pequenos gênios! Hoje vamos brincar de 'Robô Pensante'! Quem aqui já viu um robô ou um celular que parece 'inteligente'? Como será que eles sabem o que fazer? Será que eles têm um cérebro como o nosso? Vamos descobrir a mágica por trás da 'Inteligência Artificial' e ver como a matemática ajuda essas máquinas a serem super espertas! Preparem-se para dar comandos e decifrar 'segredos' de máquinas!",
  "rubrica_avaliacao": [
    {
      "criterio": "Compreensão da relação entre comandos/regras e o funcionamento de máquinas 'inteligentes'.",
      "nivel_alto": "O aluno demonstra claramente ter compreendido que máquinas inteligentes (IAs) funcionam seguindo comandos ou regras específicas, identificando e aplicando a regra correta na atividade da 'Máquina de Somar'.",
      "nivel_baixo": "O aluno apresenta dificuldade em identificar a regra ou padrão na atividade da 'Máquina de Somar', mostrando confusão sobre como os comandos ou regras influenciam o funcionamento da máquina."
    },
    {
      "criterio": "Participação e engajamento nas atividades práticas propostas.",
      "nivel_alto": "O aluno participa ativamente de todas as atividades (Robô Obediente, Máquina de Somar, Regras Robóticas), colaborando com o grupo e mostrando entusiasmo em criar ou seguir os 'comandos' e 'regras'.",
      "nivel_baixo": "O aluno demonstra pouca participação nas atividades propostas, ou apresenta dificuldade em se engajar na execução de comandos ou na criação de regras simples, necessitando de estímulo constante."
    }
  ]
}


// Objetivo -> objetivo
// Vários passo a passo
// Introdução lúdica -> introducao_ludica
// Rubricas de avaliação

// Tabela passo_a_passo -> id, etapa, descricao, id_plano (fk)
// Tabela rubrica_avaliacao -> id, criterio, nivel_alto, nivel_baixo, id_plano (fk)


// usuario -> id, nome, email, senha 
// publicacao -> id, titulo, conteudo, data_criacao, id_usuario (fk)
// One to Many (sempre guarda o fk no muitos)